.config/emacs/README.org
#+title: My GNU Emacs Configuration
#+author: Gatonegro
#+language: en
#+STARTUP: content
#+OPTIONS: toc:2

* An exercise in restraint

Configuring Emacs is, essentially, an exercise in restraint. Because it is endlessly extensible by design, an entire lifetime can be spent moulding it into all sorts of different things, for any purpose one could possibly imagine. This is what I aim to avoid here.

** What this configuration is

1. *Minimal -* As a newcomer to Emacs, and because it is my personal preference in general, I want this to be a configuration that does what I need, and nothing else. And, yes, I do realise the irony of setting that goal for a kitchen-sink piece of software such as Emacs.

2. *Transparent -* While I could go online and take snippets from other configs, and put them here to enable all manner of new functionality, I prefer to stick with a configuration I can understand at my current level of familiarity with Emacs and Elisp in general.

3. *Experimental -* Though my main goal is for this setup to be useful for my daily work, I also want to use it to explore what Emacs can do and how it works. Over time, as my familiarity with it grows, I might revisit parts of it to add or remove things. Overall, it should be a bit of a playground in addition to an actual tool that I use to get things done.

** What this configuration is not

1. *An "everything" setup -* At this point, I don't believe it would make sense for me to try and emulate the setups of advanced users who do /everything/ in Emacs — web browsing, media playing, window management, etc. I do not understand the software nearly enough to do that, and my current workflow suits me quite well. As far as functionality goes, it should be similar to my Neovim configuration instead of its own operating system.

2. *A clone of DOOM or Spacemacs -* I have not used those distributions, for the same reason I don't use Neovim distributions — they are an additional layer between the user and the software, give the user a somewhat misplaced confidence in their command of the software, and obscure fundamental aspects of it that I would prefer to get to know myself. They are useful for certain users, in certain cases, but I prefer the DIY approach.

3. *Neovim -* My preferred tool, one I am significantly more familiar and comfortable with. Trying to turn Emacs into Neovim seems silly; I already have a Neovim configuration, and it does everything I need. My Emacs configuration should be its own thing, /an Emacs thing/, that works in Emacs ways. There is probably an exception to be made here regarding modal editing and Vim motions, because Vim brain is a thing.

* Table of contents :toc:
- [[#an-exercise-in-restraint][An exercise in restraint]]
  - [[#what-this-configuration-is][What this configuration is]]
  - [[#what-this-configuration-is-not][What this configuration is not]]
- [[#the-early-initialisation-of-emacs---early-initel][The early initialisation of Emacs - =early-init.el=]]
  - [[#early-initel-header][=early-init.el= header]]
  - [[#disable-packageel][Disable =package.el=]]
  - [[#garbage-collection][Garbage collection]]
  - [[#performance-hacks]["Performance" hacks]]
  - [[#improving-the-ui][Improving the UI]]
  - [[#default-frame-configuration][Default frame configuration]]
  - [[#early-initel-footer][=early-init.el= footer]]
- [[#emacs-configuration][Emacs configuration]]
  - [[#initel-header][=init.el= header]]
  - [[#package-management---elpaca][Package management - Elpaca]]
  - [[#emacs-itself][Emacs itself]]
  - [[#dired][Dired]]
  - [[#electric][Electric]]
  - [[#window-management][Window management]]
- [[#org-mode][Org mode]]
  - [[#org-settings][Org settings]]
  - [[#org-tempo][org-tempo]]
  - [[#toc-org][toc-org]]
  - [[#org-bullets][org-bullets]]
- [[#third-party-packages][Third-party packages]]
  - [[#appearance][Appearance]]
  - [[#completions-framework][Completions framework]]
  - [[#dired-enhancements][Dired enhancements]]
  - [[#evil-mode][Evil mode]]
  - [[#which-key][Which-Key]]
  - [[#turn-me-off-later][Turn me off later!]]
  - [[#initel-footer][=init.el= footer]]

* The early initialisation of Emacs - =early-init.el=

** =early-init.el= header
#+PROPERTY: header-args :tangle "early-init.el"

Because we are doing things the "Emacs way", we begin by following convention, and having a nice header in our =early-init.el= file. We will also have a footer once we're done.

#+begin_src emacs-lisp
;;; early-init.el --- Early Init -*- no-byte-compile: t; lexical-binding: t; -*-

;; Author: Adolf Gatonegro
;; URL: https://github.com/adolfgatonegro

;;; Commentary:
;; Early initialisation file for my GNU Emacs configuration.

;;; Code:
#+end_src

** Disable =package.el=

We will use [[https://github.com/progfolio/elpaca][Elpaca]] to install and manage our packages, because it has some lovely async capabilities and a nice GUI. The built-in =package.el= is itself quite capable, and we could simply stick with it and =package-vc=, but I am not manually requiring Lua modules in my Neovim config, am I?

#+begin_src emacs-lisp
;; Disable `package.el' here, required to use Elpaca later
(setq package-enable-at-startup nil)
#+end_src

** Garbage collection

This bit comes from [[https://github.com/jamescherti/minimal-emacs.d][minimal-emacs.d]], which includes all sorts of esoteric optimisations and "better defaults" that, quite frankly, I do not understand. This one makes sense, though, and so I am lifting it. Most configurations I have encountered make some changes to the garbage collection process on startup, but this is the only one I have seen that restores the default gc settings after startup, as recommended by the Emacs documentation.

#+begin_src emacs-lisp
;;; Garbage collection
;; Garbage collection significantly affects startup times. This setting delays
;; garbage collection during startup but will be reset later.
(defvar gato-gc-cons-threshold (* 16 1024 1024)
  "The value of `gc-cons-threshold' after Emacs startup.")

(setq gc-cons-threshold most-positive-fixnum)

(add-hook 'elpaca-after-init-hook
          (lambda ()
            (setq gc-cons-threshold gato-gc-cons-threshold)))
#+end_src

** "Performance" hacks

[[https://git.sr.ht/~ashton314/emacs-bedrock][emacs-bedrock]] is a much more approachable starting point for a noob like myself. The author includes these "performance hacks" in the =early-init.el=, and they seem fairly sensible to me. How much of a difference they make, I cannot say for sure.

#+begin_src emacs-lisp
(setq byte-compile-warnings '(not obsolete))
(setq native-comp-async-report-warnings-errors 'silent)
(setq read-process-output-max (* 1024 1024 4))
(setq warning-suppress-log-types '((comp) (bytecomp)))

(setopt initial-major-mode 'fundamental-mode)  ; default mode for the *scratch* buffer
#+end_src

** Improving the UI

We want a keyboard-driven environment, and for that we do not need any of these UI elements. Besides, the Emacs UI is kind of ugly. While we're here, we also get rid of the splash screen.

#+begin_src emacs-lisp
;;; Minimal UI
(menu-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(scroll-bar-mode -1)
(pixel-scroll-precision-mode 1) ;; Enable smooth scrolling

(setq inhibit-startup-echo-area-message (user-login-name)) ;; Silence startup message
(advice-add #'display-startup-echo-area-message :override #'ignore)

(setq inhibit-splash-screen t
      use-file-dialog nil
      use-dialog-box nil
      tab-bar-new-button-show nil
      tab-bar-close-button-show nil
      tab-line-close-button-show nil)
#+end_src

** Default frame configuration

#+begin_src emacs-lisp
;; Default frame configuration
(setq frame-resize-pixelwise t)
(setq default-frame-alist '((fullscreen . maximized)
                            (vertical-scroll-bars . nil)
                            (horizontal-scroll-bars . nil)
                            (background-color . "#1a1a26")
                            (ns-appearance . dark)
                            (ns-transparent-titlebar . t)))
#+end_src

** =early-init.el= footer

That's all for the early initialisation. Now we can finish with the footer:

#+begin_src emacs-lisp
(provide 'early-init)

;;; early-init.el ends here
#+end_src

* Emacs configuration
#+PROPERTY: header-args :tangle "init.el"
With the =early-init.el= taken care of, we can begin configuring Emacs itself.

** =init.el= header

Something, something, follow convention.

#+begin_src emacs-lisp
;;; init.el --- Emacs Init -*- no-byte-compile: t; lexical-binding: t; -*-

;; Author: Adolf Gatonegro
;; URL: https://github.com/adolfgatonegro

;;; Commentary:
;; The main configuration file for Emacs.

;;; Code:
#+end_src

** Package management - Elpaca

Use this [[https://github.com/progfolio/elpaca?tab=readme-ov-file#installer][unsightly mess]] to bootstrap Elpaca.

#+begin_src emacs-lisp
;;; Package management
;; Clone, build, and initialise Elpaca.
(defvar elpaca-installer-version 0.7)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                 ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                 ,@(when-let ((depth (plist-get order :depth)))
                                                     (list (format "--depth=%d" depth) "--no-single-branch"))
                                                 ,(plist-get order :repo) ,repo))))
                 ((zerop (call-process "git" nil buffer t "checkout"
                                       (or (plist-get order :ref) "--"))))
                 (emacs (concat invocation-directory invocation-name))
                 ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                       "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                 ((require 'elpaca))
                 ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
#+end_src

Next, we enable =use-package= support for Elpaca, and set =:ensure t=
by default, to make sure we always have the packages we need.

#+begin_src emacs-lisp
;; Enable `use-package` support for convenience.
(elpaca elpaca-use-package
  (elpaca-use-package-mode))
;; Always ensure the packages we want are installed.
(setq use-package-always-ensure t)
#+end_src

